brew 'dockutil'
brew 'rbenv'
brew 'tig'
cask 'alfred'
cask 'appcleaner'
cask 'camtasia'
cask 'charles'
cask 'dash'
cask 'dropbox'
cask 'google-chrome'
cask 'obsidian'
cask 'readwise-ibooks'
cask 'visual-studio-code'

# K8
brew 'colima'
brew 'docker'
brew 'kubectl'
