# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "thoughtbot/formulae"

# Brew programming languages
#brew "cabal-install"
#brew "crystal-lang"
#brew "elixir"
#brew "elm-format"
#brew "elm"
#brew "go"
#brew "gradle"
#brew "groovy"
#brew "lua"
#brew "maven"
#brew "mercurial"
#brew "node"
brew "rbenv"
brew "ruby-build"
brew "ruby-install"
#brew "ruby"
brew "java"
brew "python"
brew "rustup-init"

# Brew infrastructure apps
#brew "ansible-cmdb"
#brew "ansible"
#brew "packer"
brew "argocd"
brew "awscli"
brew "helm"
brew "kubernetes-cli"
brew "minikube"
brew "terraform"
cask "google-cloud-sdk"

# Brew developer apps
brew "ack"
# @see https://github.com/sharkdp/bat
brew "bat"
brew "bats-core"
brew "bfg"
brew "dependency-check"
brew "diffoscope"
brew "doxygen"
brew "exercism"
brew "git-extras"
brew "git-lfs"
brew "git-tig"
brew "git"
#brew "subversion"
brew "hadolint"
brew "hub"
#brew "hugo"
brew "jq"
brew "mkcert"
brew "nss"
brew "pre-commit"
brew "prettier"
brew "shellcheck"
#brew "source-highlight"
#brew "tidy-html5"

# Brew CLI apps
#brew "aha"
#brew "dnsmasq", restart_service: true
#brew "fontconfig"
#brew "freetype"
#brew "gd"
#brew "gdbm"
#brew "gettext"
#brew "ghostscript"
#brew "gnuplot"
#brew "gperftools"
#brew "graphicsmagick"
#brew "graphviz"
#brew "imagemagick"
#brew "jpeg"
#brew "libyaml"
#brew "pandoc"
#brew "pg_top"
#brew "tmate"
#brew "tmux"
brew "autojump"
brew "coreutils" # Those that come with macOS are outdated
brew "ctags"
brew "curl"
brew "dockutil"
brew "duti"
brew "gnu-tar"
brew "htop-osx"
brew "mas"
brew "pstree"
brew "rcm"
brew "rename"
brew "rsync"
brew "tree"
brew "uncrustify"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"

# Brew Audio & Video Tools
#brew "faac"
#brew "flac"
#brew "lame"
#brew "shntool"
#brew "xvid"
#cask "soundflower"
brew "ffmpeg"
brew "mp3splt"

# Brew Security Tools
#brew "nikto"
#brew "nmap"
#brew "sleuthkit"
#brew "slowhttptest"
#brew "socat"
#brew "sslscan"
#brew "sslyze"
#brew "sysdig"
#brew "tcpflow"
#brew "wrk"
brew "pwgen"
brew "siege"
brew "sloccount"
brew "ssh-audit"

# App casks
#cask "charles"
#cask "google-chrome"
#cask "google-drive"
#cask "handbrake"
#cask "kdiff3"
#cask "keycastr"
#cask "postico"
#cask "screenflow"
#cask "sequel-pro"
#cask "the-unarchiver"
#cask "witch"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "caffeine"
cask "calibre"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "gpg-suite"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "launchcontrol"
cask "macdown"
cask "moom"
cask "numi"
cask "scrivener"
cask "slack"
cask "telegram"
cask "thunderbird"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Brew Incubator (these packages look interesting but are not tested through)
#brew "asciinema"
#brew "diff-so-fancy"
#brew "direnv"
#brew "pulumi"
#brew "zsh-autosuggestions" # .zshrc -> source /opt/homebrew/share/zsh-autosuggestions/zsh-autosuggestions.zsh
#tap "teamookla/speedtest"
#brew "speedtest"

# Font casks
cask "font-meslo-lg-nerd-font"

# Brew Quicklook packages TBD
#cask "provisionql"
#cask "qlcolorcode"
#cask "qlimagesize"
cask "qlmarkdown"
#cask "qlprettypatch"
#cask "qlstephen"
#cask "qlvideo"
#cask "quicklook-csv"
#cask "quicklook-json"
#cask "webpquicklook"

# Mac App Store apps
# mas "Affinity Designer", id: 824171161
# mas "Affinity Photo", id: 824183456
# mas "Affinity Publisher", id: 881418622
# mas "Day One Classic", id: 422304217
# mas "Integrity", id: 513610341
# mas "iThoughtsX", id: 720669838
# mas "Monodraw", id: 920404675
# mas "Monosnap", id: 540348655
# mas "Name Mangler", id: 402434720
# mas "Xcode", id: 497799835
